In [1]:
from datetime import datetime
import pandas as pd
import numpy as np

In [2]:
datetime.now()

datetime.datetime(2019, 11, 9, 13, 31, 28, 907035)

In [3]:
t1 = datetime.now()
t2 = datetime(1970, 1,1)
t3 = datetime(1980, 12,2,12,23,34)
print(t1,t2,t3)

2019-11-09 13:33:25.824179 1970-01-01 00:00:00 1980-12-02 12:23:34

In [5]:
diff = t1-t2
diff

datetime.timedelta(days=18209, seconds=48805, microseconds=824179)

In [7]:
t1.year, t1.month, t1.weekday(), t1.day, t1.hour, t1.minute

(2019, 11, 5, 9, 13, 33)

In [8]:
dates = [datetime(2019,1,23), datetime(2019,1,25)]

In [9]:
dt_index = pd.DatetimeIndex(dates)

In [11]:
data = np.random.randn(2,2)
cols=['A','B']
df = pd.DataFrame(data=data, index=dt_index, columns=cols)

In [12]:
df

                   A         B
2019-01-23 -1.179312 -0.746962
2019-01-25 -0.074854 -0.667773

In [14]:
ebola = pd.read_csv('data/time/country_timeseries.csv')
ebola.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 122 entries, 0 to 121
Data columns (total 18 columns):
Date                   122 non-null object
Day                    122 non-null int64
Cases_Guinea           93 non-null float64
Cases_Liberia          83 non-null float64
Cases_SierraLeone      87 non-null float64
Cases_Nigeria          38 non-null float64
Cases_Senegal          25 non-null float64
Cases_UnitedStates     18 non-null float64
Cases_Spain            16 non-null float64
Cases_Mali             12 non-null float64
Deaths_Guinea          92 non-null float64
Deaths_Liberia         81 non-null float64
Deaths_SierraLeone     87 non-null float64
Deaths_Nigeria         38 non-null float64
Deaths_Senegal         22 non-null float64
Deaths_UnitedStates    18 non-null float64
Deaths_Spain           16 non-null float64
Deaths_Mali            12 non-null float64
dtypes: float64(16), int64(1), object(1)
memory usage: 17.2+ KB

In [15]:
ebola['date_dt'] = pd.to_datetime(ebola.Date)

In [17]:
ebola[['Date', 'date_dt']].head()

         Date    date_dt
0    1/5/2015 2015-01-05
1    1/4/2015 2015-01-04
2    1/3/2015 2015-01-03
3    1/2/2015 2015-01-02
4  12/31/2014 2014-12-31

In [19]:
ebola['date_dt'][0].year, ebola['date_dt'][0].day

(2015, 5)

In [20]:
ebola['year'] = ebola['date_dt'].dt.year

In [23]:
ebola['month'], ebola['day'] = ebola['date_dt'].dt.month, ebola['date_dt'].dt.day

In [25]:
ebola['outbreak_d'] = ebola['date_dt']-ebola['date_dt'].min()

In [27]:
ebola[['Date','Day', 'outbreak_d']].head(10)

         Date  Day outbreak_d
0    1/5/2015  289   289 days
1    1/4/2015  288   288 days
2    1/3/2015  287   287 days
3    1/2/2015  286   286 days
4  12/31/2014  284   284 days
5  12/28/2014  281   281 days
6  12/27/2014  280   280 days
7  12/24/2014  277   277 days
8  12/21/2014  273   274 days
9  12/20/2014  272   273 days